export type IRegionLocation = {
  id: number;
  name: string;
  coordinates: [number, number];
};

export const regionLocations: IRegionLocation[] = [
  {
    id: 1,
    name: "Москва",
    coordinates: [55.7558, 37.6173],
  },
  {
    id: 2,
    name: "Санкт-Петербург",
    coordinates: [59.9343, 30.3351],
  },
  {
    id: 3,
    name: "Севастополь",
    coordinates: [44.6166, 33.5254],
  },
  {
    id: 4,
    name: "Республика Адыгея",
    coordinates: [44.6078, 40.1058],
  },
  {
    id: 5,
    name: "Республика Алтай",
    coordinates: [51.9582, 85.9602],
  },
  {
    id: 6,
    name: "Республика Башкортостан",
    coordinates: [54.7349, 55.9578],
  },
  {
    id: 7,
    name: "Республика Бурятия",
    coordinates: [51.8334, 107.5841],
  },
  {
    id: 8,
    name: "Республика Дагестан",
    coordinates: [42.9849, 47.5047],
  },
  {
    id: 9,
    name: "Донецкая Народная Республика",
    coordinates: [48.0159, 37.8029],
  },
  {
    id: 10,
    name: "Республика Ингушетия",
    coordinates: [43.1667, 44.8167],
  },
  {
    id: 11,
    name: "Кабардино-Балкарская Республика",
    coordinates: [43.4846, 43.6029],
  },
  {
    id: 12,
    name: "Республика Калмыкия",
    coordinates: [46.3078, 44.2558],
  },
  {
    id: 13,
    name: "Карачаево-Черкесская Республика",
    coordinates: [43.9133, 41.9173],
  },
  {
    id: 14,
    name: "Республика Карелия",
    coordinates: [61.7849, 34.3469],
  },
  {
    id: 15,
    name: "Республика Коми",
    coordinates: [61.6688, 50.8366],
  },
  {
    id: 16,
    name: "Республика Крым",
    coordinates: [45.0333, 34.1],
  },
  {
    id: 17,
    name: "Луганская Народная Республика",
    coordinates: [48.5671, 39.3171],
  },
  {
    id: 18,
    name: "Республика Марий Эл",
    coordinates: [56.6345, 47.8742],
  },
  {
    id: 19,
    name: "Республика Мордовия",
    coordinates: [54.1838, 45.1749],
  },
  {
    id: 20,
    name: "Республика Саха (Якутия)",
    coordinates: [62.0339, 129.7331],
  },
  {
    id: 21,
    name: "Республика Северная Осетия — Алания",
    coordinates: [43.0367, 44.6678],
  },
  {
    id: 22,
    name: "Республика Татарстан",
    coordinates: [55.7887, 49.1221],
  },
  {
    id: 23,
    name: "Республика Тыва",
    coordinates: [51.7194, 94.4377],
  },
  {
    id: 24,
    name: "Удмуртская Республика",
    coordinates: [56.8498, 53.2045],
  },
  {
    id: 25,
    name: "Республика Хакасия",
    coordinates: [53.7156, 91.4292],
  },
  {
    id: 26,
    name: "Чеченская Республика",
    coordinates: [43.3179, 45.6987],
  },
  {
    id: 27,
    name: "Чувашская Республика",
    coordinates: [56.1322, 47.2519],
  },
  {
    id: 28,
    name: "Алтайский край",
    coordinates: [53.3548, 83.7698],
  },
  {
    id: 29,
    name: "Забайкальский край",
    coordinates: [52.034, 113.501],
  },
  {
    id: 30,
    name: "Камчатский край",
    coordinates: [53.0234, 158.6478],
  },
  {
    id: 31,
    name: "Краснодарский край",
    coordinates: [45.0355, 38.9753],
  },
  {
    id: 32,
    name: "Красноярский край",
    coordinates: [56.009, 92.8719],
  },
  {
    id: 33,
    name: "Пермский край",
    coordinates: [58.0105, 56.2502],
  },
  {
    id: 34,
    name: "Приморский край",
    coordinates: [43.1332, 131.9113],
  },
  {
    id: 35,
    name: "Ставропольский край",
    coordinates: [45.0428, 41.9734],
  },
  {
    id: 36,
    name: "Хабаровский край",
    coordinates: [48.4827, 135.0846],
  },
  {
    id: 37,
    name: "Амурская область",
    coordinates: [50.2785, 127.5391],
  },
  {
    id: 38,
    name: "Архангельская область",
    coordinates: [64.5401, 40.5433],
  },
  {
    id: 39,
    name: "Астраханская область",
    coordinates: [46.3497, 48.0408],
  },
  {
    id: 40,
    name: "Белгородская область",
    coordinates: [50.5977, 36.5858],
  },
  {
    id: 41,
    name: "Брянская область",
    coordinates: [53.2521, 34.3717],
  },
  {
    id: 42,
    name: "Владимирская область",
    coordinates: [56.1291, 40.4075],
  },
  {
    id: 43,
    name: "Волгоградская область",
    coordinates: [48.7194, 44.5018],
  },
  {
    id: 44,
    name: "Вологодская область",
    coordinates: [59.2239, 39.8839],
  },
  {
    id: 45,
    name: "Воронежская область",
    coordinates: [51.672, 39.1843],
  },
  {
    id: 46,
    name: "Запорожская область",
    coordinates: [47.8388, 35.1396],
  },
  {
    id: 47,
    name: "Ивановская область",
    coordinates: [57.005, 40.9737],
  },
  {
    id: 48,
    name: "Иркутская область",
    coordinates: [52.2978, 104.2967],
  },
  {
    id: 49,
    name: "Калининградская область",
    coordinates: [54.7074, 20.5073],
  },
  {
    id: 50,
    name: "Калужская область",
    coordinates: [54.5293, 36.2754],
  },
  {
    id: 51,
    name: "Кемеровская область",
    coordinates: [55.3333, 86.0833],
  },
  {
    id: 52,
    name: "Кировская область",
    coordinates: [58.5966, 49.6601],
  },
  {
    id: 53,
    name: "Костромская область",
    coordinates: [57.7665, 40.9269],
  },
  {
    id: 54,
    name: "Курганская область",
    coordinates: [55.4411, 65.3456],
  },
  {
    id: 55,
    name: "Курская область",
    coordinates: [51.7373, 36.1874],
  },
  {
    id: 56,
    name: "Ленинградская область",
    coordinates: [59.9343, 30.3351],
  },
  {
    id: 57,
    name: "Липецкая область",
    coordinates: [52.6031, 39.5708],
  },
  {
    id: 58,
    name: "Магаданская область",
    coordinates: [59.5681, 150.8085],
  },
  {
    id: 59,
    name: "Московская область",
    coordinates: [55.7558, 37.6173],
  },
  {
    id: 60,
    name: "Мурманская область",
    coordinates: [68.9585, 33.0827],
  },
  {
    id: 61,
    name: "Нижегородская область",
    coordinates: [56.2965, 43.9361],
  },
  {
    id: 62,
    name: "Новгородская область",
    coordinates: [58.5213, 31.2759],
  },
  {
    id: 63,
    name: "Новосибирская область",
    coordinates: [55.0415, 82.9346],
  },
  {
    id: 64,
    name: "Омская область",
    coordinates: [54.9885, 73.3242],
  },
  {
    id: 65,
    name: "Оренбургская область",
    coordinates: [51.7727, 55.0988],
  },
  {
    id: 66,
    name: "Орловская область",
    coordinates: [52.9685, 36.0692],
  },
  {
    id: 67,
    name: "Пензенская область",
    coordinates: [53.1959, 45.0288],
  },
  {
    id: 68,
    name: "Псковская область",
    coordinates: [57.8136, 28.3496],
  },
  {
    id: 69,
    name: "Ростовская область",
    coordinates: [47.2357, 39.7015],
  },
  {
    id: 70,
    name: "Рязанская область",
    coordinates: [54.6269, 39.6916],
  },
  {
    id: 71,
    name: "Самарская область",
    coordinates: [53.2001, 50.15],
  },
  {
    id: 72,
    name: "Саратовская область",
    coordinates: [51.5406, 46.0086],
  },
  {
    id: 73,
    name: "Сахалинская область",
    coordinates: [46.9641, 142.7285],
  },
  {
    id: 74,
    name: "Свердловская область",
    coordinates: [56.8519, 60.6122],
  },
  {
    id: 75,
    name: "Смоленская область",
    coordinates: [54.7818, 32.0401],
  },
  {
    id: 76,
    name: "Тамбовская область",
    coordinates: [52.7317, 41.4433],
  },
  {
    id: 77,
    name: "Тверская область",
    coordinates: [56.8587, 35.9176],
  },
  {
    id: 78,
    name: "Томская область",
    coordinates: [56.4847, 84.9481],
  },
  {
    id: 79,
    name: "Тульская область",
    coordinates: [54.1961, 37.6182],
  },
  {
    id: 80,
    name: "Тюменская область",
    coordinates: [57.1522, 65.5272],
  },
  {
    id: 81,
    name: "Ульяновская область",
    coordinates: [54.3181, 48.3832],
  },
  {
    id: 82,
    name: "Херсонская область",
    coordinates: [46.6354, 32.6169],
  },
  {
    id: 83,
    name: "Челябинская область",
    coordinates: [55.1644, 61.4368],
  },
  {
    id: 84,
    name: "Ярославская область",
    coordinates: [57.6299, 39.8737],
  },
  {
    id: 85,
    name: "Еврейская автономная область",
    coordinates: [48.7894, 132.9217],
  },
  {
    id: 86,
    name: "Ненецкий автономный округ",
    coordinates: [67.6381, 53.0069],
  },
  {
    id: 87,
    name: "Ханты-Мансийский автономный округ — Югра",
    coordinates: [61.0042, 69.0019],
  },
  {
    id: 88,
    name: "Чукотский автономный округ",
    coordinates: [64.7336, 177.5161],
  },
  {
    id: 89,
    name: "Ямало-Ненецкий автономный округ",
    coordinates: [66.5293, 66.6019],
  },
];

////

export type Coordinates = [number, number];
export type ILocation = {
  name: string;
  coordinates: Coordinates;
};

export type Village = {
  name: string;
  coordinates: Coordinates;
};

export type City = {
  name: string;
  coordinates: Coordinates;
  villages?: Village[];
};

export type District = {
  name: string;
  coordinates: Coordinates;
  cities?: City[];
  villages?: Village[];
};

export type IRegion = {
  id: number;
  region: string;
  districts: District[];
  city?: City[];
};

export const cityesLocations: IRegion[] = [
  {
    id: 1,
    region: "Адыгея Республика",
    districts: [
      {
        name: "Гиагинский Район",
        coordinates: [44.5667, 40.0667],
        villages: [
          { name: "Владимировское Село", coordinates: [44.25, 40.1667] },
          { name: "Вольно-Веселый Хутор", coordinates: [44.255, 40.17] },
          { name: "Георгиевское Село", coordinates: [44.26, 40.175] },
          { name: "Гиагинская Станица", coordinates: [44.265, 40.18] },
          { name: "Гончарка Поселок", coordinates: [44.27, 40.185] },

          { name: "Днепровский Хутор", coordinates: [44.275, 40.19] },
          { name: "Дондуковская Станица", coordinates: [44.28, 40.195] },
          { name: "Екатериновский Хутор", coordinates: [44.285, 40.2] },

          { name: "Карцев Хутор", coordinates: [44.29, 40.205] },
          { name: "Келермесская Станица", coordinates: [44.295, 40.21] },
          { name: "Козополянский Хутор", coordinates: [44.3, 40.215] },

          { name: "Колхозный Хутор", coordinates: [44.305, 40.22] },
          { name: "Красный Пахарь Хутор", coordinates: [44.31, 40.225] },
          { name: "Красный Хлебороб Хутор", coordinates: [44.315, 40.23] },
          { name: "Курский Хутор", coordinates: [44.32, 40.235] },
          { name: "Лесной Поселок", coordinates: [44.325, 40.24] },

          { name: "Михельсоновский Хутор", coordinates: [44.33, 40.245] },
          { name: "Нечаевский Хутор", coordinates: [44.335, 40.25] },
          { name: "Нижний Айрюм Село", coordinates: [44.34, 40.255] },
          { name: "Новый Поселок", coordinates: [44.345, 40.26] },
          { name: "Образцовое Село", coordinates: [44.35, 40.265] },
          {
            name: "Огородные участки ц.водозабора Территория",
            coordinates: [44.355, 40.27],
          },
          { name: "Первомайский Хутор", coordinates: [44.36, 40.275] },
          { name: "Прогресс Хутор", coordinates: [44.365, 40.28] },

          { name: "Садовый Хутор", coordinates: [44.37, 40.285] },

          { name: "Сергиевское Село", coordinates: [44.375, 40.29] },
          { name: "Смольчев-Малиновский Хутор", coordinates: [44.38, 40.295] },

          { name: "Тамбовский Хутор", coordinates: [44.385, 40.3] },

          { name: "Фарсовский Хутор", coordinates: [44.39, 40.305] },
          { name: "Черемушкин Поселок", coordinates: [44.395, 40.31] },
          { name: "Черемушкин Хутор", coordinates: [44.4, 40.315] },
          { name: "Шишкинский Хутор", coordinates: [44.405, 40.32] },
        ],
        cities: [
          { name: "Адыгейск Город", coordinates: [44.88, 39.19] },
          { name: "Майкоп Город", coordinates: [44.6098, 40.1006] },
        ],
      },
      { name: "Кошехабльский Район", coordinates: [44.55, 40.15] },
      { name: "Красногвардейский Район", coordinates: [44.55, 40.25] },
      { name: "Майкопский Район", coordinates: [44.25, 40.1667] },
      { name: "Тахтамукайский Район", coordinates: [44.3333, 40.25] },
      { name: "Теучежский Район", coordinates: [44.45, 40.35] },
      { name: "Шовгеновский Район", coordinates: [44.5667, 40.4667] },
    ],
  },

  {
    id: 2,
    region: "Башкортостан Республика",
    districts: [
      { name: "Абзелиловский Район", coordinates: [52.9833, 58.8333] },
      { name: "Альшеевский Район", coordinates: [54.2333, 55.2833] },
      { name: "Архангельский Район", coordinates: [53.45, 56.5] },
      { name: "Аскинский Район", coordinates: [54.8333, 58.1667] },
      { name: "Аургазинский Район", coordinates: [54.2667, 56.7167] },
      { name: "Баймакский Район", coordinates: [53.4667, 58.3667] },
      { name: "Бакалинский Район", coordinates: [54.5, 56.8] },
      { name: "Балтачевский Район", coordinates: [55.2, 56.15] },
      { name: "Белебеевский Район", coordinates: [54.1, 56.2833] },
      { name: "Белокатайский Район", coordinates: [53.9333, 57.4667] },
      { name: "Белорецкий Район", coordinates: [53.9667, 58.4167] },
      { name: "Бижбулякский Район", coordinates: [54.9333, 55.8167] },
      { name: "Бирский Район", coordinates: [55.3, 56.0] },
      { name: "Благоварский Район", coordinates: [54.4167, 55.4167] },
      { name: "Благовещенский Район", coordinates: [54.3333, 55.1] },
      { name: "Буздякский Район", coordinates: [55.0167, 55.5] },
      { name: "Бураевский Район", coordinates: [53.8667, 56.6] },
      { name: "Бурзянский Район", coordinates: [54.35, 57.1667] },
      { name: "Гафурийский Район", coordinates: [54.5167, 56.3] },
      { name: "Давлекановский Район", coordinates: [54.3667, 55.2] },
      { name: "Дуванский Район", coordinates: [54.5333, 55.4] },
      { name: "Дюртюлинский Район", coordinates: [54.3833, 56.5167] },
      { name: "Ермекеевский Район", coordinates: [54.8333, 55.75] },
      { name: "Зианчуринский Район", coordinates: [54.9667, 56.9667] },
      { name: "Зилаирский Район", coordinates: [53.95, 58.1667] },
      { name: "Иглинский Район", coordinates: [54.1167, 56.6167] },
      { name: "Илишевский Район", coordinates: [54.8, 56.4] },
      { name: "Ишимбайский Район", coordinates: [54.4833, 56.05] },
      { name: "Калтасинский Район", coordinates: [54.55, 56.95] },
      { name: "Караидельский Район", coordinates: [54.1, 56.8333] },
      { name: "Кармаскалинский Район", coordinates: [54.8833, 55.5333] },
      { name: "Кигинский Район", coordinates: [55.0333, 57.1] },
      { name: "Краснокамский Район", coordinates: [56.25, 56.3833] },
      { name: "Кугарчинский Район", coordinates: [54.9, 56.4167] },
      { name: "Кушнаренковский Район", coordinates: [55.1167, 56.4] },
      { name: "Куюргазинский Район", coordinates: [54.3, 56.35] },
      { name: "Мелеузовский Район", coordinates: [53.7, 58.2] },
      { name: "Мечетлинский Район", coordinates: [54.8667, 56.0] },
      { name: "Мишкинский Район", coordinates: [54.5167, 56.8833] },
      { name: "Миякинский Район", coordinates: [54.4667, 56.2] },
      { name: "Нуримановский Район", coordinates: [55.15, 56.75] },
      { name: "Салаватский Район", coordinates: [53.4, 55.85] },
      { name: "Стерлибашевский Район", coordinates: [55.2167, 56.6167] },
      { name: "Стерлитамакский Район", coordinates: [54.15, 55.9] },
      { name: "Татышлинский Район", coordinates: [54.5667, 55.5667] },
      { name: "Туймазинский Район", coordinates: [54.7833, 55.75] },
      { name: "Уфимский Район", coordinates: [54.7667, 56.0667] },
      { name: "Учалинский Район", coordinates: [54.1667, 58.35] },
      { name: "Федоровский Район", coordinates: [55.2333, 56.4333] },
      { name: "Хайбуллинский Район", coordinates: [54.15, 56.1] },
      { name: "Чекмагушевский Район", coordinates: [55.05, 56.05] },
      { name: "Чишминский Район", coordinates: [54.9, 56.5] },
      { name: "Шаранский Район", coordinates: [54.3667, 56.8333] },
      { name: "Янаульский Район", coordinates: [55.2833, 56.6] },
    ],
    city: [
      { name: "Агидель Город", coordinates: [53.6333, 58.4667] },
      { name: "Амзинский Сельсовет", coordinates: [55.1167, 56.3333] },
      { name: "Кумертау Город", coordinates: [53.15, 56.0] },
      { name: "Маячинский Сельсовет", coordinates: [55.4167, 56.05] },
      { name: "Межгорье Город", coordinates: [54.2, 58.4] },
      { name: "Нефтекамск Город", coordinates: [56.0833, 54.25] },
      { name: "Октябрьский Город", coordinates: [54.9667, 55.4333] },
      { name: "Подгорный Сельсовет", coordinates: [55.6333, 55.9667] },
      { name: "Салават Город", coordinates: [53.4, 55.85] },
      { name: "Сибай Город", coordinates: [53.6667, 58.6333] },
      { name: "Стерлитамак Город", coordinates: [54.15, 55.9] },
      { name: "Ташкиновский Сельсовет", coordinates: [55.1667, 56.05] },
      { name: "Туялясский Сельсовет", coordinates: [54.5, 56.3667] },
      { name: "Уфа Город", coordinates: [54.7667, 56.0667] },
    ],
  },
];

// {
//   id: ,
//   region: "",
//   districts: []
// },
